commit;

/* 웹 */
insert into categoryno values(1, 'Total Notify');
insert into categoryno values(2, 'User Notify');
insert into categoryno values(3, 'Shop Notify');

insert INTO users (id, password, gender, location, birth, `managerIdentified`, `shopNo`)
		    VALUES('admin', 'admin', 'man', '서울', '19901031', 0, null);
			
/* 앱 */
insert into itemcategory (content) values ('생수/음료/커피');
insert into itemcategory (content) values ('유제품/냉장ㆍ동');
insert into itemcategory (content) values ('과자/초콜렛/빵');
insert into itemcategory (content) values ('라면/통조림/장');
insert into itemcategory (content) values ('과일/견과/채소');

/* 통계용 User */
insert INTO users (id, password, gender, location, birth, `managerIdentified`, `shopNo`)
		    VALUES('0001@test', 'test', 'man', 'location', 'birth', manageridentified, shopno);
			
/* 매장 mock data */
insert into shop (address, newaddress, name, phone, picture, introduce, longitude, latitude) 
VALUES ('서울특별시 서초구 서초2동 1327-13', '서울특별시 서초구 서초2동 1327-13', 'CU 호정점', '02-3234-2234', 'http://i.imgur.com/dRgyauE.jpg', '어서오세요 CU 효정점입니다.', 127.027652, 37.494633),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', 'CU 코아점', '02-3234-4233', 'http://i.imgur.com/bhCGimu.jpg', '어서오세요 CU 코아점입니다.', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1326', '서울특별시 서초구 서초2동 1326', '뚜레쥬르 서초점', '02-3324-4233', 'http://i.imgur.com/9fbcz5p.jpg', '뚜레쥬르입니다', 127.027045, 37.493032),
('서울특별시 서초구 서초2동 1333', '서울특별시 서초구 서초2동 1333', '파리바게뜨 트라팰리스점', '02-3201-4233', 'http://i.imgur.com/Ky1Cwbz.jpg', '파리바게뜨 트라팰리스점~', 127.027221, 37.494995),
('서울특별시 서초구 서초2동 1364', '서울특별시 서초구 서초2동 1364', 'GS25 동양점', '02-3232-4233', 'http://i.imgur.com/l4evO2T.jpg', 'GS25 어서오세요', 127.027941, 37.494781),
('서울특별시 서초구 서초2동 1321', '서울특별시 서초구 서초2동 1321', 'GS25 대룡점', '02-3234-7758', 'http://i.imgur.com/GDRZ3Qz.jpg', 'GS25 대룡점입니다', 127.027007, 37.494266),
('서울특별시 서초구 서초2동 1357', '서울특별시 서초구 서초2동 1357', '세븐일레븐 서울빌딩점', '02-3234-1113', 'http://i.imgur.com/KrO1OIc.jpg', '환영합니다', 127.027885, 37.494700),

('서울특별시 서초구 서초2동 1311', '서울특별시 서초구 서초2동 1311', '파리바게뜨 우리점', '02-3234-1133', 'http://i.imgur.com/Ky1Cwbz.jpg', '어서오세요 우리점입니다', 127.029701, 37.494619),
('서울특별시 서초구 서초2동 1333', '서울특별시 서초구 서초2동 1333', '뚜레쥬르 삼성점', '02-3234-2233', 'http://i.imgur.com/yBMkhpo.jpg', '뚜레쥬르입니다', 127.029320, 37.494732),
('서울특별시 서초구 서초2동 1343', '서울특별시 서초구 서초2동 1343', '', '02-3234-3333', '', '', 127.029445, 37.494632),
('서울특별시 서초구 서초2동 1367', '서울특별시 서초구 서초2동 1367', '', '02-3234-4433', '', '', 127.029545, 37.494532),
('서울특별시 서초구 서초2동 1123', '서울특별시 서초구 서초2동 1123', '', '02-3234-5533', '', '', 127.029500, 37.494432),
('서울특별시 서초구 서초2동 1334', '서울특별시 서초구 서초2동 1334', '', '02-3234-6633', '', '', 127.029345, 37.494332),
('서울특별시 서초구 서초2동 1341', '서울특별시 서초구 서초2동 1341', '', '02-3234-7733', '', '', 127.029245, 37.494232),
('서울특별시 서초구 서초2동 1221', '서울특별시 서초구 서초2동 1221', '', '02-3234-8833', '', '', 127.029145, 37.494132),
('서울특별시 서초구 서초2동 1222', '서울특별시 서초구 서초2동 1222', '뚜레쥬스 사랑점', '02-3234-9933', 'http://i.imgur.com/TnycUwJ.jpg', '환영합니다', 127.029045, 37.494632),
('서울특별시 서초구 서초2동 1224', '서울특별시 서초구 서초2동 1224', '', '02-3234-0033', '', '', 127.028945, 37.494532),
('서울특별시 서초구 서초2동 1322', '서울특별시 서초구 서초2동 1322', '', '02-3234-1223', '', '', 127.028845, 37.494432),
('서울특별시 서초구 서초2동 1228', '서울특별시 서초구 서초2동 1228', '', '02-3234-4253', '', '', 127.028745, 37.494232),
('서울특별시 서초구 서초2동 1242', '서울특별시 서초구 서초2동 1242', '', '02-3234-4563', '', '', 127.028645, 37.494132),
('서울특별시 서초구 서초2동 1245', '서울특별시 서초구 서초2동 1245', '파리바게뜨 석양점', '02-3234-4773', 'http://i.imgur.com/WpirupQ.jpg', '파리바게뜨', 127.028545, 37.494632),
('서울특별시 서초구 서초2동 1247', '서울특별시 서초구 서초2동 1247', '', '02-3234-4903', '', '', 127.028445, 37.494532),

('서울특별시 서초구 서초2동 1250', '서울특별시 서초구 서초2동 1250', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1251', '서울특별시 서초구 서초2동 1251', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1253', '서울특별시 서초구 서초2동 1253', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1256', '서울특별시 서초구 서초2동 1256', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1259', '서울특별시 서초구 서초2동 1259', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1261', '서울특별시 서초구 서초2동 1261', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1262', '서울특별시 서초구 서초2동 1262', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1264', '서울특별시 서초구 서초2동 1264', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1267', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1273', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1278', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1291', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1299', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1310', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1333', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1343', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1347', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1349', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1351', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1355', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1357', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1358', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1359', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1360', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),

('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', '', '02-3234-4233', '', '', 127.027745, 37.494032),