commit;

/* 웹 */
insert into categoryno values(1, 'Total Notify');
insert into categoryno values(2, 'User Notify');
insert into categoryno values(3, 'Shop Notify');

insert INTO users (id, password, gender, location, birth, `managerIdentified`, `shopNo`)
		    VALUES('admin', 'admin', 'man', '서울', '19901031', 0, null);
			
/* 앱 */
insert into itemcategory (content) values ('생수/음료/커피');
insert into itemcategory (content) values ('유제품/냉장ㆍ동');
insert into itemcategory (content) values ('과자/초콜렛/빵');
insert into itemcategory (content) values ('라면/통조림/장');
insert into itemcategory (content) values ('과일/견과/채소');

/* 통계용 User */
insert INTO users (id, password, gender, location, birth, `managerIdentified`, `shopNo`)
		    VALUES('0001@test', 'test', 'man', 'location', 'birth', manageridentified, shopno);
			
/* 매장 mock data (상품있음) */
insert into shop (address, newaddress, name, phone, picture, introduce, longitude, latitude) 
VALUES ('서울특별시 서초구 서초2동 1327-13', '서울특별시 서초구 서초2동 1327-13', 'CU 호정점', '02-3234-2234', 'http://i.imgur.com/dRgyauE.jpg', '어서오세요 CU 효정점입니다.', 127.027152, 37.494633),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', 'CU 코아점', '02-3234-4233', 'http://i.imgur.com/bhCGimu.jpg', '어서오세요 CU 코아점입니다.', 127.026412, 37.495894),
('서울특별시 서초구 서초2동 1326', '서울특별시 서초구 서초2동 1326', '뚜레쥬르 서초점', '02-3324-4233', 'http://i.imgur.com/9fbcz5p.jpg', '뚜레쥬르입니다', 127.027356, 37.493922),
('서울특별시 서초구 서초2동 1333', '서울특별시 서초구 서초2동 1333', '파리바게뜨 트라팰리스점', '02-3201-4233', 'http://i.imgur.com/Ky1Cwbz.jpg', '파리바게뜨 트라팰리스점~', 127.028386, 37.493756),
('서울특별시 서초구 서초2동 1364', '서울특별시 서초구 서초2동 1364', 'GS25 동양점', '02-3232-4233', 'http://i.imgur.com/l4evO2T.jpg', 'GS25 어서오세요', 127.029212, 37.493718),
('서울특별시 서초구 서초2동 1321', '서울특별시 서초구 서초2동 1321', 'GS25 대룡점', '02-3234-7758', 'http://i.imgur.com/GDRZ3Qz.jpg', 'GS25 대룡점입니다', 127.028316, 37.493820),
('서울특별시 서초구 서초2동 1357', '서울특별시 서초구 서초2동 1357', '세븐일레븐 서울빌딩점', '02-3234-1113', 'http://i.imgur.com/KrO1OIc.jpg', '환영합니다', 127.027973, 37.494126),
('서울특별시 서초구 서초2동 1311', '서울특별시 서초구 서초2동 1311', '파리바게뜨 우리점', '02-3234-1133', 'http://i.imgur.com/Ky1Cwbz.jpg', '어서오세요 우리점입니다', 127.027544, 37.494339),
('서울특별시 서초구 서초2동 1333', '서울특별시 서초구 서초2동 1333', '뚜레쥬르 삼성점', '02-3234-2233', 'http://i.imgur.com/yBMkhpo.jpg', '뚜레쥬르입니다', 127.028011, 37.494505),
('서울특별시 서초구 서초2동 1343', '서울특별시 서초구 서초2동 1343', '빵수레', '02-3234-3333', 'http://i.imgur.com/aaIqiMw.jpg', '빵수레', 127.027689, 37.495195),
('서울특별시 서초구 서초2동 1367', '서울특별시 서초구 서초2동 1367', 'GS25 우정점', '02-3234-4433', 'http://i.imgur.com/hQ8YmHS.jpg', 'GS25에 어서오세요~', 127.027448, 37.495135),
('서울특별시 서초구 서초2동 1123', '서울특별시 서초구 서초2동 1123', 'Swan Cafe', '02-3234-5533', 'http://i.imgur.com/xMvaUfn.jpg', 'swan cafe', 127.027309, 37.495365),
('서울특별시 서초구 서초2동 1334', '서울특별시 서초구 서초2동 1334', 'Baking Story', '02-3234-6633', 'http://i.imgur.com/fz2iLK7.jpg', 'baking story입니다', 127.026931, 37.495702),
('서울특별시 서초구 서초2동 1341', '서울특별시 서초구 서초2동 1341', '세븐일레븐 희망점', '02-3234-7733', 'http://i.imgur.com/qYY3b8Q.jpg', '희망점입니다', 127.026864, 37.496069),
('서울특별시 서초구 서초2동 1221', '서울특별시 서초구 서초2동 1221', '뚜레쥬르 강남역점', '02-3234-8833', 'http://i.imgur.com/CAIT5eo.jpg', '강남역점입니다', 127.027337, 37.496261),
('서울특별시 서초구 서초2동 1222', '서울특별시 서초구 서초2동 1222', '뚜레쥬스 사랑점', '02-3234-9933', 'http://i.imgur.com/TnycUwJ.jpg', '환영합니다', 127.028747, 37.496287),
('서울특별시 서초구 서초2동 1224', '서울특별시 서초구 서초2동 1224', '세븐일레븐 상장점', '02-3234-0033', 'http://i.imgur.com/KrO1OIc.jpg', '편의점', 127.028637, 37.496600),
('서울특별시 서초구 서초2동 1322', '서울특별시 서초구 서초2동 1322', '파리바게뜨 강남2점', '02-3234-1223', 'http://i.imgur.com/BjB06f5.jpg', '강남역 100m안에 있습니다', 127.028543, 37.496932),
('서울특별시 서초구 서초2동 1228', '서울특별시 서초구 서초2동 1228', 'CU 별빛점', '02-3234-4253', 'http://i.imgur.com/EHqxjwn.png', 'CU', 127.028267, 37.497368),
('서울특별시 서초구 서초2동 1242', '서울특별시 서초구 서초2동 1242', 'Hotel DOUCE', '02-3234-4563', 'http://i.imgur.com/y6zGfUY.jpg', 'Hotel DOUCE', 127.027460, 37.496872),
('서울특별시 서초구 서초2동 1245', '서울특별시 서초구 서초2동 1245', '파리바게뜨 석양점', '02-3234-4773', 'http://i.imgur.com/WpirupQ.jpg', '파리바게뜨', 127.027315, 37.497332),
('서울특별시 서초구 서초2동 1247', '서울특별시 서초구 서초2동 1247', '세븐일레븐 신한점', '02-3234-4903', 'http://i.imgur.com/FmMnSp4.jpg', '신한은행 옆에 있습니다', 127.029701, 37.494619);

/* 매장 mock data (상품없음) */
insert into shop (address, newaddress, name, phone, picture, introduce, longitude, latitude) 
VALUES ('서울특별시 서초구 서초2동 1327-13', '서울특별시 서초구 서초2동 1327-13', 'CU 호정점', '02-3234-2234', 'http://i.imgur.com/dRgyauE.jpg', '어서오세요 CU 효정점입니다.', 127.017152, 37.474633),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', 'CU 코아점', '02-3234-4233', 'http://i.imgur.com/bhCGimu.jpg', '어서오세요 CU 코아점입니다.', 127.016412, 37.465894),
('서울특별시 서초구 서초2동 1326', '서울특별시 서초구 서초2동 1326', '뚜레쥬르 서초점', '02-3324-4233', 'http://i.imgur.com/9fbcz5p.jpg', '뚜레쥬르입니다', 127.017356, 37.493922),
('서울특별시 서초구 서초2동 1333', '서울특별시 서초구 서초2동 1333', '파리바게뜨 트라팰리스점', '02-3201-4233', 'http://i.imgur.com/Ky1Cwbz.jpg', '파리바게뜨 트라팰리스점~', 127.018386, 37.493756),
('서울특별시 서초구 서초2동 1364', '서울특별시 서초구 서초2동 1364', 'GS25 동양점', '02-3232-4233', 'http://i.imgur.com/l4evO2T.jpg', 'GS25 어서오세요', 127.019212, 37.493718),
('서울특별시 서초구 서초2동 1321', '서울특별시 서초구 서초2동 1321', 'GS25 대룡점', '02-3234-7758', 'http://i.imgur.com/GDRZ3Qz.jpg', 'GS25 대룡점입니다', 127.018316, 37.493820),
('서울특별시 서초구 서초2동 1357', '서울특별시 서초구 서초2동 1357', '세븐일레븐 서울빌딩점', '02-3234-1113', 'http://i.imgur.com/KrO1OIc.jpg', '환영합니다', 127.037973, 37.494126),
('서울특별시 서초구 서초2동 1311', '서울특별시 서초구 서초2동 1311', '파리바게뜨 우리점', '02-3234-1133', 'http://i.imgur.com/Ky1Cwbz.jpg', '어서오세요 우리점입니다', 127.037544, 37.494339),
('서울특별시 서초구 서초2동 1333', '서울특별시 서초구 서초2동 1333', '뚜레쥬르 삼성점', '02-3234-2233', 'http://i.imgur.com/yBMkhpo.jpg', '뚜레쥬르입니다', 127.038011, 37.494505),
('서울특별시 서초구 서초2동 1343', '서울특별시 서초구 서초2동 1343', '빵수레', '02-3234-3333', 'http://i.imgur.com/aaIqiMw.jpg', '빵수레', 127.037689, 37.495195),
('서울특별시 서초구 서초2동 1367', '서울특별시 서초구 서초2동 1367', 'GS25 우정점', '02-3234-4433', 'http://i.imgur.com/hQ8YmHS.jpg', 'GS25에 어서오세요~', 127.047448, 37.495135),
('서울특별시 서초구 서초2동 1123', '서울특별시 서초구 서초2동 1123', 'Swan Cafe', '02-3234-5533', 'http://i.imgur.com/xMvaUfn.jpg', 'swan cafe', 127.047309, 37.495365),
('서울특별시 서초구 서초2동 1334', '서울특별시 서초구 서초2동 1334', 'Baking Story', '02-3234-6633', 'http://i.imgur.com/fz2iLK7.jpg', 'baking story입니다', 127.046931, 37.495702),
('서울특별시 서초구 서초2동 1341', '서울특별시 서초구 서초2동 1341', '세븐일레븐 희망점', '02-3234-7733', 'http://i.imgur.com/qYY3b8Q.jpg', '희망점입니다', 127.046864, 37.496069),
('서울특별시 서초구 서초2동 1221', '서울특별시 서초구 서초2동 1221', '뚜레쥬르 강남역점', '02-3234-8833', 'http://i.imgur.com/CAIT5eo.jpg', '강남역점입니다', 127.047337, 37.496261),
('서울특별시 서초구 서초2동 1222', '서울특별시 서초구 서초2동 1222', '뚜레쥬스 사랑점', '02-3234-9933', 'http://i.imgur.com/TnycUwJ.jpg', '환영합니다', 127.058747, 37.496287),
('서울특별시 서초구 서초2동 1224', '서울특별시 서초구 서초2동 1224', '세븐일레븐 상장점', '02-3234-0033', 'http://i.imgur.com/KrO1OIc.jpg', '편의점', 127.058637, 37.496600),
('서울특별시 서초구 서초2동 1322', '서울특별시 서초구 서초2동 1322', '파리바게뜨 강남2점', '02-3234-1223', 'http://i.imgur.com/BjB06f5.jpg', '강남역 100m안에 있습니다', 127.058543, 37.496932),
('서울특별시 서초구 서초2동 1228', '서울특별시 서초구 서초2동 1228', 'CU 별빛점', '02-3234-4253', 'http://i.imgur.com/EHqxjwn.png', 'CU', 127.058267, 37.497368),
('서울특별시 서초구 서초2동 1242', '서울특별시 서초구 서초2동 1242', 'Hotel DOUCE', '02-3234-4563', 'http://i.imgur.com/y6zGfUY.jpg', 'Hotel DOUCE', 127.057460, 37.496872),
('서울특별시 서초구 서초2동 1245', '서울특별시 서초구 서초2동 1245', '파리바게뜨 석양점', '02-3234-4773', 'http://i.imgur.com/WpirupQ.jpg', '파리바게뜨', 127.057315, 37.497332),
('서울특별시 서초구 서초2동 1247', '서울특별시 서초구 서초2동 1247', '세븐일레븐 신한점', '02-3234-4903', 'http://i.imgur.com/FmMnSp4.jpg', '신한은행 옆에 있습니다', 127.059701, 37.494619),
('서울특별시 서초구 서초2동 1327-13', '서울특별시 서초구 서초2동 1327-13', 'CU 호정점', '02-3234-2234', 'http://i.imgur.com/dRgyauE.jpg', '어서오세요 CU 효정점입니다.', 127.017152, 37.474633),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', 'CU 코아점', '02-3234-4233', 'http://i.imgur.com/bhCGimu.jpg', '어서오세요 CU 코아점입니다.', 127.016412, 37.465894),
('서울특별시 서초구 서초2동 1326', '서울특별시 서초구 서초2동 1326', '뚜레쥬르 서초점', '02-3324-4233', 'http://i.imgur.com/9fbcz5p.jpg', '뚜레쥬르입니다', 127.017356, 37.453922),
('서울특별시 서초구 서초2동 1333', '서울특별시 서초구 서초2동 1333', '파리바게뜨 트라팰리스점', '02-3201-4233', 'http://i.imgur.com/Ky1Cwbz.jpg', '파리바게뜨 트라팰리스점~', 127.018386, 37.443756),
('서울특별시 서초구 서초2동 1364', '서울특별시 서초구 서초2동 1364', 'GS25 동양점', '02-3232-4233', 'http://i.imgur.com/l4evO2T.jpg', 'GS25 어서오세요', 127.019212, 37.433718),
('서울특별시 서초구 서초2동 1321', '서울특별시 서초구 서초2동 1321', 'GS25 대룡점', '02-3234-7758', 'http://i.imgur.com/GDRZ3Qz.jpg', 'GS25 대룡점입니다', 127.018316, 37.423820),
('서울특별시 서초구 서초2동 1357', '서울특별시 서초구 서초2동 1357', '세븐일레븐 서울빌딩점', '02-3234-1113', 'http://i.imgur.com/KrO1OIc.jpg', '환영합니다', 127.037973, 37.474126),
('서울특별시 서초구 서초2동 1311', '서울특별시 서초구 서초2동 1311', '파리바게뜨 우리점', '02-3234-1133', 'http://i.imgur.com/Ky1Cwbz.jpg', '어서오세요 우리점입니다', 127.037544, 37.494339),
('서울특별시 서초구 서초2동 1333', '서울특별시 서초구 서초2동 1333', '뚜레쥬르 삼성점', '02-3234-2233', 'http://i.imgur.com/yBMkhpo.jpg', '뚜레쥬르입니다', 127.038011, 37.474505),
('서울특별시 서초구 서초2동 1343', '서울특별시 서초구 서초2동 1343', '빵수레', '02-3234-3333', 'http://i.imgur.com/aaIqiMw.jpg', '빵수레', 127.037689, 37.465195),
('서울특별시 서초구 서초2동 1367', '서울특별시 서초구 서초2동 1367', 'GS25 우정점', '02-3234-4433', 'http://i.imgur.com/hQ8YmHS.jpg', 'GS25에 어서오세요~', 127.047448, 37.455135),
('서울특별시 서초구 서초2동 1123', '서울특별시 서초구 서초2동 1123', 'Swan Cafe', '02-3234-5533', 'http://i.imgur.com/xMvaUfn.jpg', 'swan cafe', 127.047309, 37.445365),
('서울특별시 서초구 서초2동 1334', '서울특별시 서초구 서초2동 1334', 'Baking Story', '02-3234-6633', 'http://i.imgur.com/fz2iLK7.jpg', 'baking story입니다', 127.046931, 37.435702),
('서울특별시 서초구 서초2동 1341', '서울특별시 서초구 서초2동 1341', '세븐일레븐 희망점', '02-3234-7733', 'http://i.imgur.com/qYY3b8Q.jpg', '희망점입니다', 127.046864, 37.426069),
('서울특별시 서초구 서초2동 1221', '서울특별시 서초구 서초2동 1221', '뚜레쥬르 강남역점', '02-3234-8833', 'http://i.imgur.com/CAIT5eo.jpg', '강남역점입니다', 127.047337, 37.416261),
('서울특별시 서초구 서초2동 1222', '서울특별시 서초구 서초2동 1222', '뚜레쥬스 사랑점', '02-3234-9933', 'http://i.imgur.com/TnycUwJ.jpg', '환영합니다', 127.058747, 37.496287),
('서울특별시 서초구 서초2동 1224', '서울특별시 서초구 서초2동 1224', '세븐일레븐 상장점', '02-3234-0033', 'http://i.imgur.com/KrO1OIc.jpg', '편의점', 127.058637, 37.486600),
('서울특별시 서초구 서초2동 1322', '서울특별시 서초구 서초2동 1322', '파리바게뜨 강남2점', '02-3234-1223', 'http://i.imgur.com/BjB06f5.jpg', '강남역 100m안에 있습니다', 127.058543, 37.476932),
('서울특별시 서초구 서초2동 1228', '서울특별시 서초구 서초2동 1228', 'CU 별빛점', '02-3234-4253', 'http://i.imgur.com/EHqxjwn.png', 'CU', 127.058267, 37.467368),
('서울특별시 서초구 서초2동 1242', '서울특별시 서초구 서초2동 1242', 'Hotel DOUCE', '02-3234-4563', 'http://i.imgur.com/y6zGfUY.jpg', 'Hotel DOUCE', 127.057460, 37.456872),
('서울특별시 서초구 서초2동 1245', '서울특별시 서초구 서초2동 1245', '파리바게뜨 석양점', '02-3234-4773', 'http://i.imgur.com/WpirupQ.jpg', '파리바게뜨', 127.057315, 37.447332),
('서울특별시 서초구 서초2동 1247', '서울특별시 서초구 서초2동 1247', '세븐일레븐 신한점', '02-3234-4903', 'http://i.imgur.com/FmMnSp4.jpg', '신한은행 옆에 있습니다', 127.059701, 37.434619),
('서울특별시 서초구 서초2동 1327-13', '서울특별시 서초구 서초2동 1327-13', 'CU 호정점', '02-3234-2234', 'http://i.imgur.com/dRgyauE.jpg', '어서오세요 CU 효정점입니다.', 127.017152, 37.474633),
('서울특별시 서초구 서초2동 1330', '서울특별시 서초구 서초2동 1330', 'CU 코아점', '02-3234-4233', 'http://i.imgur.com/bhCGimu.jpg', '어서오세요 CU 코아점입니다.', 127.016412, 37.495894),
('서울특별시 서초구 서초2동 1326', '서울특별시 서초구 서초2동 1326', '뚜레쥬르 서초점', '02-3324-4233', 'http://i.imgur.com/9fbcz5p.jpg', '뚜레쥬르입니다', 127.017356, 37.483922),
('서울특별시 서초구 서초2동 1333', '서울특별시 서초구 서초2동 1333', '파리바게뜨 트라팰리스점', '02-3201-4233', 'http://i.imgur.com/Ky1Cwbz.jpg', '파리바게뜨 트라팰리스점~', 127.018386, 37.473756),
('서울특별시 서초구 서초2동 1364', '서울특별시 서초구 서초2동 1364', 'GS25 동양점', '02-3232-4233', 'http://i.imgur.com/l4evO2T.jpg', 'GS25 어서오세요', 127.019212, 37.463718),
('서울특별시 서초구 서초2동 1321', '서울특별시 서초구 서초2동 1321', 'GS25 대룡점', '02-3234-7758', 'http://i.imgur.com/GDRZ3Qz.jpg', 'GS25 대룡점입니다', 127.018316, 37.453820),
('서울특별시 서초구 서초2동 1357', '서울특별시 서초구 서초2동 1357', '세븐일레븐 서울빌딩점', '02-3234-1113', 'http://i.imgur.com/KrO1OIc.jpg', '환영합니다', 127.037973, 37.444126),
('서울특별시 서초구 서초2동 1311', '서울특별시 서초구 서초2동 1311', '파리바게뜨 우리점', '02-3234-1133', 'http://i.imgur.com/Ky1Cwbz.jpg', '어서오세요 우리점입니다', 127.037544, 37.434339),
('서울특별시 서초구 서초2동 1333', '서울특별시 서초구 서초2동 1333', '뚜레쥬르 삼성점', '02-3234-2233', 'http://i.imgur.com/yBMkhpo.jpg', '뚜레쥬르입니다', 127.038011, 37.424505),
('서울특별시 서초구 서초2동 1343', '서울특별시 서초구 서초2동 1343', '빵수레', '02-3234-3333', 'http://i.imgur.com/aaIqiMw.jpg', '빵수레', 127.037689, 37.415195),
('서울특별시 서초구 서초2동 1367', '서울특별시 서초구 서초2동 1367', 'GS25 우정점', '02-3234-4433', 'http://i.imgur.com/hQ8YmHS.jpg', 'GS25에 어서오세요~', 127.047448, 37.495135),
('서울특별시 서초구 서초2동 1123', '서울특별시 서초구 서초2동 1123', 'Swan Cafe', '02-3234-5533', 'http://i.imgur.com/xMvaUfn.jpg', 'swan cafe', 127.047309, 37.485365),
('서울특별시 서초구 서초2동 1334', '서울특별시 서초구 서초2동 1334', 'Baking Story', '02-3234-6633', 'http://i.imgur.com/fz2iLK7.jpg', 'baking story입니다', 127.046931, 37.475702),
('서울특별시 서초구 서초2동 1341', '서울특별시 서초구 서초2동 1341', '세븐일레븐 희망점', '02-3234-7733', 'http://i.imgur.com/qYY3b8Q.jpg', '희망점입니다', 127.046864, 37.466069),
('서울특별시 서초구 서초2동 1221', '서울특별시 서초구 서초2동 1221', '뚜레쥬르 강남역점', '02-3234-8833', 'http://i.imgur.com/CAIT5eo.jpg', '강남역점입니다', 127.047337, 37.456261),
('서울특별시 서초구 서초2동 1222', '서울특별시 서초구 서초2동 1222', '뚜레쥬스 사랑점', '02-3234-9933', 'http://i.imgur.com/TnycUwJ.jpg', '환영합니다', 127.058747, 37.446287),
('서울특별시 서초구 서초2동 1224', '서울특별시 서초구 서초2동 1224', '세븐일레븐 상장점', '02-3234-0033', 'http://i.imgur.com/KrO1OIc.jpg', '편의점', 127.058637, 37.436600),
('서울특별시 서초구 서초2동 1322', '서울특별시 서초구 서초2동 1322', '파리바게뜨 강남2점', '02-3234-1223', 'http://i.imgur.com/BjB06f5.jpg', '강남역 100m안에 있습니다', 127.058543, 37.426932),
('서울특별시 서초구 서초2동 1228', '서울특별시 서초구 서초2동 1228', 'CU 별빛점', '02-3234-4253', 'http://i.imgur.com/EHqxjwn.png', 'CU', 127.058267, 37.417368),
('서울특별시 서초구 서초2동 1242', '서울특별시 서초구 서초2동 1242', 'Hotel DOUCE', '02-3234-4563', 'http://i.imgur.com/y6zGfUY.jpg', 'Hotel DOUCE', 127.057460, 37.496872),
('서울특별시 서초구 서초2동 1245', '서울특별시 서초구 서초2동 1245', '파리바게뜨 석양점', '02-3234-4773', 'http://i.imgur.com/WpirupQ.jpg', '파리바게뜨', 127.057315, 37.487332),
('서울특별시 서초구 서초2동 1247', '서울특별시 서초구 서초2동 1247', '세븐일레븐 신한점', '02-3234-4903', 'http://i.imgur.com/FmMnSp4.jpg', '신한은행 옆에 있습니다', 127.059701, 37.474619);